In [1]:
import pandas as pd

In [2]:
#This shoude be available in the git hub as I made changes

In [2]:
s1 = pd.Series([10,20,30,40,50,60])

In [3]:
print(s1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [4]:
s2 = pd.Series([10,20,30,40,50,60], index = ['a','b','c','d','e','f'], name = "Scores")

In [5]:
print(s2)

a    10
b    20
c    30
d    40
e    50
f    60
Name: Scores, dtype: int64

In [6]:
data = {'a':10, 'b': 20, 'c': 30, 'd': 40}

In [7]:
s3 = pd.Series(data)
print(s3)

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
import numpy as np
np_array = pd.array([10,20,30,40])
s4 = pd.Series(np_array)
print(s4)

0    10
1    20
2    30
3    40
dtype: Int64

In [9]:
data = {'a': 10, 'b':1.1, 'c':"Hello", 'd':True}

In [10]:
s5 = pd.Series(data)

In [11]:
print(s5)

a       10
b      1.1
c    Hello
d     True
dtype: object

In [12]:
data = {'a':10, 'b':True, 1: 1.1, 2: "Hello"}
s5 = pd.Series(data)
print(s5)

a       10
b     True
1      1.1
2    Hello
dtype: object

In [13]:
data = {'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [14]:
s6 = pd.Series(data, name = 'Scores')

In [15]:
print(s6)

a    10
b    20
c    30
d    40
Name: Scores, dtype: int64

In [16]:
print(s6.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
print(s6.values)

[10 20 30 40]

In [18]:
print(s6.dtype)

int64

In [19]:
print(s6.name)

Scores

In [20]:
print(s6)

a    10
b    20
c    30
d    40
Name: Scores, dtype: int64

In [21]:
print(s6.loc['a'])

10

In [22]:
print(s6.iloc[0])

10

In [23]:
print(s6[0])

10

C:\Users\aukar\AppData\Local\Temp\ipykernel_29012\37769319.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s6[0])

In [25]:
data = { 'a':10, 'b':20, 'c':30, 'd':40, 0:100, 1:101, 2:400, 6:700}
s7 = pd.Series(data)
print(s7)

a     10
b     20
c     30
d     40
0    100
1    101
2    400
6    700
dtype: int64

In [26]:
s7.loc[0:2]

0    100
1    101
2    400
dtype: int64

In [ ]:
s7.loc[0:6]#final index is inclusive

0    100
1    101
2    400
6    700
dtype: int64

In [28]:
data = {
    'Name': ['Anant','Pushpak','Nikhil'],
    'Age': [24, 26, 28],
    'City': ['Bengaluru','Hyderabad','Pune']
}

In [29]:
df = pd.DataFrame(data)
print(df)

      Name  Age       City
0    Anant   24  Bengaluru
1  Pushpak   26  Hyderabad
2   Nikhil   28       Pune

In [32]:
data_1 = [
    {'Name':'Anant', 'Age':'24', 'City':'Bengaluru'},
    {'Name':'Pushpak', 'Age':'26', 'City':'Hyderabad'},
    {'Name':'Nikhil', 'Age':'28', 'City': 'Pune'}

]

In [33]:
df_1 = pd.DataFrame(data_1)
print(df_1)

      Name Age       City
0    Anant  24  Bengaluru
1  Pushpak  26  Hyderabad
2   Nikhil  28       Pune

In [34]:
arr_data = np.array([[1,2],[3,4],[5,6]])

In [35]:
df_2 = pd.DataFrame(arr_data)
print(df_2)

   0  1
0  1  2
1  3  4
2  5  6

In [36]:
df_2 = pd.DataFrame(arr_data, columns=['A','B'])
print(df_2)

   A  B
0  1  2
1  3  4
2  5  6

In [37]:
data = {
    'Name': ['Anant','Pushpak','Nikhil'],
    'Age': [24, 26, 28],
    'City': ['Bengaluru','Hyderabad','Pune']
}

In [38]:
df_4 = pd.DataFrame(data)
print(df_4)

      Name  Age       City
0    Anant   24  Bengaluru
1  Pushpak   26  Hyderabad
2   Nikhil   28       Pune

In [46]:
print(df_4['Name'])
print("="*40)
print(df_4[['Name','Age']])
print("="*40)
print(df_4.loc[0])
print("="*40)
print(df_4.loc[0:1])
print("="*40)
print(df_4.iloc[0])
print("="*40)
print(df_4.iloc[0:1])

0      Anant
1    Pushpak
2     Nikhil
Name: Name, dtype: object
========================================
      Name  Age
0    Anant   24
1  Pushpak   26
2   Nikhil   28
========================================
Name        Anant
Age            24
City    Bengaluru
Name: 0, dtype: object
========================================
      Name  Age       City
0    Anant   24  Bengaluru
1  Pushpak   26  Hyderabad
========================================
Name        Anant
Age            24
City    Bengaluru
Name: 0, dtype: object
========================================
    Name  Age       City
0  Anant   24  Bengaluru

In [4]:
df = pd.read_csv("titanic.csv")

In [52]:
#preview of data frame
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
#last 5 rows
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [54]:
print(df.tail())

     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [55]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [56]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [57]:
df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [58]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [60]:
df.loc[0,'Name']

'Braund, Mr. Owen Harris'

In [61]:
df.loc[0:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [63]:
df.iloc[0:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [64]:
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [65]:
df.iloc[0,3]

'Braund, Mr. Owen Harris'

In [66]:
df[df['Age']>70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [67]:
df[df['Age']<20]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [68]:
older_pass = df[df['Age']>70]

In [69]:
older_pass

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [71]:
#identify number of females that survived
df[(df['Sex'] == 'female') & df['Survived'] == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [72]:
#identify number of females that survived
female_survivor_subset = df[(df['Sex'] == 'female') & df['Survived'] == 1][['Name','Age']]

In [73]:
female_survivor_subset

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [74]:
female_survivor_subset.head()

                                                Name   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0

In [75]:
female_survivor_subset.head(10)

                                                 Name   Age
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                              Heikkinen, Miss. Laina  26.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0
10                    Sandstrom, Miss. Marguerite Rut   4.0
11                           Bonnell, Miss. Elizabeth  58.0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0
19                            Masselmani, Mrs. Fatima   NaN
22                        McGowan, Miss. Anna "Annie"  15.0

In [81]:
#total number of survivors
print(len(df[df['Survived'] == 1]))

342

In [84]:
survived = len(df[df['Survived'] == 1])
not_survived = len(df[df['Survived'] == 0])
print(survived+not_survived)

891

In [85]:
survived/(survived+not_survived)

0.3838383838383838

In [86]:
not_survived/(survived+not_survived)

0.6161616161616161

In [8]:
female_survivors_subset_loc = df.loc[(df['Sex']=='female') & (df['Survived']== 1),['Name','Age']]
female_survivors_subset_loc

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [11]:
df.loc[0,'Cabin']#instead of 0, we have put the condition

nan

In [14]:
#number of survivors
print(len(df[df['Survived']==1]))

342

In [16]:
#Slicing rows and columns
df.loc[0:4,['Name','Age']]

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [17]:
df.iloc[0:3, 0:2]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1

In [19]:
df.iloc[0:3,0:3:2]

   PassengerId  Pclass
0            1       3
1            2       1
2            3       3

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
df.iloc[0:3,[1,3]]

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina

In [22]:
df.iloc[0:3,[3,1]]

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1

In [23]:
df.loc[0:2,['Survived','Name']]

   Survived                                               Name
0         0                            Braund, Mr. Owen Harris
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina

In [24]:
df.loc[0:2,['Name','Survived']]

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1

In [25]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [27]:
subset = df[df['Sex']== 'male']
subset['Age'] = subset['Age'] + 1
print(subset)

     PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
5              6         0       3                Moran, Mr. James  male
6              7         0       1         McCarthy, Mr. Timothy J  male
7              8         0       3  Palsson, Master. Gosta Leonard  male
..           ...       ...     ...                             ...   ...
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
886          887         0       2           Montvila, Rev. Juozas  male
889          890         1       1           Behr, Mr. Karl Howell  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    23.0      1      0         A/5 21171   7.2500   NaN        S
4    36.0      0      0            373450   8.0500   NaN        S
5     NaN      0      0            330877   8.4583   NaN        Q
6    55.0      0      0             17463  51.8625   E46        S
7     3.0      3      1            349909  21.0750   NaN        S
..    ...    ...    ...               ...      ...   ...      ...
883  29.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884  26.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
886  28.0      0      0            211536  13.0000   NaN        S
889  27.0      0      0            111369  30.0000  C148        C
890  33.0      0      0            370376   7.7500   NaN        Q

[577 rows x 12 columns]

C:\Users\aukar\AppData\Local\Temp\ipykernel_39768\1238005537.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset['Age'] = subset['Age'] + 1

In [28]:
subset = df[df['Sex']=='male'].copy()
subset['Age'] += 1
print(subset)

     PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
5              6         0       3                Moran, Mr. James  male
6              7         0       1         McCarthy, Mr. Timothy J  male
7              8         0       3  Palsson, Master. Gosta Leonard  male
..           ...       ...     ...                             ...   ...
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
886          887         0       2           Montvila, Rev. Juozas  male
889          890         1       1           Behr, Mr. Karl Howell  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    23.0      1      0         A/5 21171   7.2500   NaN        S
4    36.0      0      0            373450   8.0500   NaN        S
5     NaN      0      0            330877   8.4583   NaN        Q
6    55.0      0      0             17463  51.8625   E46        S
7     3.0      3      1            349909  21.0750   NaN        S
..    ...    ...    ...               ...      ...   ...      ...
883  29.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884  26.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
886  28.0      0      0            211536  13.0000   NaN        S
889  27.0      0      0            111369  30.0000  C148        C
890  33.0      0      0            370376   7.7500   NaN        Q

[577 rows x 12 columns]

In [31]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [33]:
df_by_name = df.set_index('Name')
df_by_name.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [34]:
print(df_by_name.loc['Allen, Mr. William Henry'])

PassengerId         5
Survived            0
Pclass              3
Sex              male
Age              35.0
SibSp               0
Parch               0
Ticket         373450
Fare             8.05
Cabin             NaN
Embarked            S
Name: Allen, Mr. William Henry, dtype: object

In [36]:
df_by_name = df_by_name.reset_index()
df_by_name.head()

,index,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,4,"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
#reindex
sales_jan = pd.DataFrame({
    'Sales': [250, 400, 300]
}, index = ['Store_A','Store_B', 'Store_C'])
sales_jan

         Sales
Store_A    250
Store_B    400
Store_C    300

In [38]:
sales_feb = pd.DataFrame({
    'Sales': [260,310]
}, index = ['Store_A', 'Store_C'])
sales_feb

         Sales
Store_A    260
Store_C    310

In [39]:
common_index = sales_jan.index

In [40]:
sales_feb_aligned = sales_feb.reindex(common_index)

In [41]:
sales_feb_aligned

         Sales
Store_A  260.0
Store_B    NaN
Store_C  310.0

In [42]:
sales_diff = sales_feb_aligned['Sales'] - sales_jan['Sales']

In [43]:
sales_diff

Store_A    10.0
Store_B     NaN
Store_C    10.0
Name: Sales, dtype: float64

In [44]:
sales_feb_aligned = sales_feb.reindex(common_index, fill_value=0)
sales_feb_aligned

         Sales
Store_A    260
Store_B      0
Store_C    310

In [45]:
sales_diff = sales_feb_aligned['Sales'] - sales_jan['Sales']
sales_diff

Store_A     10
Store_B   -400
Store_C     10
Name: Sales, dtype: int64

In [47]:
source_a = pd.DataFrame({
    'Product' : ['Laptop','Tablet','Phone'],
    'Price' : [1000, 500, 800],
    'Stock' : [30, 50, 100]
}
)
source_a

  Product  Price  Stock
0  Laptop   1000     30
1  Tablet    500     50
2   Phone    800    100

In [48]:
source_b = pd.DataFrame({
    'Price': [980, 520, 810],
    'Product': ['Laptop','Tablet', 'Phone']
})
source_b

   Price Product
0    980  Laptop
1    520  Tablet
2    810   Phone

In [49]:
aligned_b = source_b.reindex(columns=source_a.columns, fill_value=0)
aligned_b

  Product  Price  Stock
0  Laptop    980      0
1  Tablet    520      0
2   Phone    810      0

In [50]:
#iteration in pandas
df = pd.DataFrame({
    'Name': ['Heartine','Gagan','Gavin'],
    'Age': [25, 20, 23],
    'City': ['Delhi','Mumbai','Chennai']
})

In [56]:
for index, row in df.iterrows():
    #print(index, row, end='\n\n')
    print(f"{index}: {row['Name']} lives in {row['City']} and is {row['Age']} years old.")

0: Heartine lives in Delhi and is 25 years old.
1: Gagan lives in Mumbai and is 20 years old.
2: Gavin lives in Chennai and is 23 years old.

In [58]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Heartine', Age=25, City='Delhi')
Pandas(Index=1, Name='Gagan', Age=20, City='Mumbai')
Pandas(Index=2, Name='Gavin', Age=23, City='Chennai')

In [59]:
for row in df.itertuples():
    print(row.Name)

Heartine
Gagan
Gavin

In [60]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [61]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [62]:
for i in df.index:
    print(i)

0
1
2

In [64]:
for col in df.columns:
    print(f"Columns: {col}")
    print(df[col].values, end="\n\n")

Columns: Name
['Heartine' 'Gagan' 'Gavin']

Columns: Age
[25 20 23]

Columns: City
['Delhi' 'Mumbai' 'Chennai']

In [65]:
#condition based column creation using custom logic
df.head()

       Name  Age     City
0  Heartine   25    Delhi
1     Gagan   20   Mumbai
2     Gavin   23  Chennai

In [67]:
df

       Name  Age     City
0  Heartine   25    Delhi
1     Gagan   20   Mumbai
2     Gavin   23  Chennai

In [69]:
#if age>20 then senior, else young
values = []
for idx, row in df.iterrows():
    if row['Age']<20:
        values.append("young")
    else:
        values.append("senior")


df['Category'] = values

In [70]:
df

       Name  Age     City Category
0  Heartine   25    Delhi   senior
1     Gagan   20   Mumbai   senior
2     Gavin   23  Chennai   senior

In [71]:
#vectorized using apply
df = pd.DataFrame({
    'Name': ['Heartine','Gagan','Gavin'],
    'Age': [25, 20, 23],
    'City': ['Delhi','Mumbai','Chennai']
})

In [72]:
df

       Name  Age     City
0  Heartine   25    Delhi
1     Gagan   20   Mumbai
2     Gavin   23  Chennai

In [73]:
df['Categories'] = df['Age'].apply(lambda age: 'young' if age < 30 else 'senior')

In [74]:
df

       Name  Age     City Categories
0  Heartine   25    Delhi      young
1     Gagan   20   Mumbai      young
2     Gavin   23  Chennai      young

In [75]:
df = pd.read_csv("titanic.csv")

In [76]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [77]:
sorted_df = df.sort_values(by="Age")
sorted_df[['Name','Age']].head(5)

                                Name   Age
803  Thomas, Master. Assad Alexander  0.42
755        Hamalainen, Master. Viljo  0.67
644           Baclini, Miss. Eugenie  0.75
469    Baclini, Miss. Helene Barbara  0.75
78     Caldwell, Master. Alden Gates  0.83

In [78]:
sorted_df[["Name","Age"]].tail()

                                         Name  Age
859                          Razi, Mr. Raihed  NaN
863         Sage, Miss. Dorothy Edith "Dolly"  NaN
868               van Melkebeke, Mr. Philemon  NaN
878                        Laleff, Mr. Kristo  NaN
888  Johnston, Miss. Catherine Helen "Carrie"  NaN

In [80]:
sorted_df.loc[0:100,["Name","Age"]]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
289                               Connolly, Miss. Kate  22.0
323  Caldwell, Mrs. Albert Francis (Sylvia Mae Harb...  22.0
243                      Maenpaa, Mr. Matti Alexanteri  22.0
521                                    Vovk, Mr. Janko  22.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
399                   Trout, Mrs. William H (Jessie L)  28.0
392                       Gustafsson, Mr. Johan Birger  28.0
635                                  Davis, Miss. Mary  28.0
100                            Petranec, Miss. Matilda  28.0

[146 rows x 2 columns]

In [81]:
print(df['Age'].dtype)

float64

In [83]:
df['Age'] = df['Age'].astype('int64')

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [84]:
df['Age'] = df['Age'].fillna(0).astype('int64')

In [85]:
print(df['Age'].dtype)

int64

In [86]:
sorted_df = df.sort_values(by="Age")
print(sorted_df[["Name","Age"]].tail(20))

                                          Name  Age
625                      Sutton, Mr. Frederick   61
570                         Harris, Mr. George   62
829  Stone, Mrs. George Nelson (Martha Evelyn)   62
252                  Stead, Mr. William Thomas   62
555                         Wright, Mr. George   62
275          Andrews, Miss. Kornelia Theodosia   63
483                     Turkula, Mrs. (Hedwig)   63
545               Nicholson, Mr. Arthur Ernest   64
438                          Fortune, Mr. Mark   64
54              Ostby, Mr. Engelhart Cornelius   65
456                  Millet, Mr. Francis Davis   65
280                           Duane, Mr. Frank   65
33                       Wheadon, Mr. Edward H   66
116                       Connors, Mr. Patrick   70
745               Crosby, Capt. Edward Gifford   70
672                Mitchell, Mr. Henry Michael   70
493                    Artagaveytia, Mr. Ramon   71
96                   Goldschmidt, Mr. George B   71
851                        Svensson, Mr. Johan   74
630       Barkworth, Mr. Algernon Henry Wilson   80

In [87]:
print(sorted_df[["Name","Age"]].head(20))

                                         Name  Age
28              O'Dwyer, Miss. Ellen "Nellie"    0
306                   Fleming, Miss. Margaret    0
457         Kenyon, Mrs. Frederick R (Marion)    0
454                       Peduzzi, Mr. Joseph    0
451           Hagland, Mr. Ingvald Olai Olsen    0
305            Allison, Master. Hudson Trevor    0
527                        Farthing, Mr. John    0
653             O'Leary, Miss. Hanora "Norah"    0
444         Johannesen-Bratthammer, Mr. Bernt    0
650                         Mitkoff, Mr. Mito    0
481          Frost, Mr. Anthony Wood "Archie"    0
648                        Willey, Mr. Edward    0
644                    Baclini, Miss. Eugenie    0
643                           Foo, Mr. Choong    0
888  Johnston, Miss. Catherine Helen "Carrie"    0
846                  Sage, Mr. Douglas Bullen    0
17               Williams, Mr. Charles Eugene    0
82             McDermott, Miss. Brigdet Delia    0
78              Caldwell, Master. Alden Gates    0
77                   Moutal, Mr. Rahamin Haim    0

In [88]:
#sort by multiple columns
df_sorted = df.sort_values(by=['Pclass','Fare'])

In [89]:
df_sorted.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
263,264,0,1,"Harrison, Mr. William",male,40,0,0,112059,0.0,B94,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,0,0,0,112052,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0.0,A36,S
815,816,0,1,"Fry, Mr. Richard",male,0,0,0,112058,0.0,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38,0,0,19972,0.0,NaN,S

In [90]:
df_sorted = df.sort_values(by=['Pclass','Fare'], ascending=[True,False])

In [91]:
df_sorted.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23,3,2,19950,263.0000,C23 C25 C27,S

In [92]:
#axis=0 rows
#axis=1 columns
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [93]:
df_sort_2=df.set_index('PassengerId')

In [94]:
df_sorted_by_index = df_sort_2.sort_index()

In [95]:
df_sorted_by_index.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [96]:
df_sort_2

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,NaN,Q

In [97]:
df_sorted_by_index_c = df_sort_2.sort_index(axis=1)

In [98]:
df_sorted_by_index_c

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
1,22,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171
2,38,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599
3,26,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282
4,35,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803
5,35,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450
...,...,...,...,...,...,...,...,...,...,...,...
887,27,NaN,S,13.0000,"Montvila, Rev. Juozas",0,2,male,0,0,211536
888,19,B42,S,30.0000,"Graham, Miss. Margaret Edith",0,1,female,0,1,112053
889,0,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,3,female,1,0,W./C. 6607
890,26,C148,C,30.0000,"Behr, Mr. Karl Howell",0,1,male,0,1,111369
891,32,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,3,male,0,0,370376

In [99]:
df_sorted_by_index

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,NaN,Q

In [100]:
df_sorted_by_index = df_sorted_by_index.sort_index(axis=0, ascending=False)

In [101]:
df_sorted_by_index.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q
890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0,1,2,W./C. 6607,23.45,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,NaN,S

In [102]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,NaN,Q

In [103]:
df_sorted_cols = df.sort_index(axis=1)

In [105]:
df_sorted_cols.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282
3,35,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803
4,35,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450

In [106]:
#changing column order in pandas
df = pd.read_csv("titanic.csv")

In [107]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [108]:
new_order = ['Name', 'Sex', 'Age','Pclass','Fare','Survived']

In [110]:
df_reordered = df[new_order]
df_reordered.head()

,Name,Sex,Age,Pclass,Fare,Survived
0,"Braund, Mr. Owen Harris",male,22.0,3,7.2500,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,71.2833,1
2,"Heikkinen, Miss. Laina",female,26.0,3,7.9250,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,53.1000,1
4,"Allen, Mr. William Henry",male,35.0,3,8.0500,0

In [111]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [112]:
sorted(df.columns)

['Age',
 'Cabin',
 'Embarked',
 'Fare',
 'Name',
 'Parch',
 'PassengerId',
 'Pclass',
 'Sex',
 'SibSp',
 'Survived',
 'Ticket']

In [113]:
df_reordered = df[sorted(df.columns)]

In [114]:
df_reordered

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
886,27.0,NaN,S,13.0000,"Montvila, Rev. Juozas",0,887,2,male,0,0,211536
887,19.0,B42,S,30.0000,"Graham, Miss. Margaret Edith",0,888,1,female,0,1,112053
888,NaN,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0,W./C. 6607
889,26.0,C148,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1,111369
890,32.0,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0,370376

In [115]:
#working with text data
df = pd.read_csv("titanic.csv")

In [116]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
print(df[["Name","Sex","Cabin"]].head(3))

                                                Name     Sex Cabin
0                            Braund, Mr. Owen Harris    male   NaN
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   C85
2                             Heikkinen, Miss. Laina  female   NaN

In [121]:
print(df['Name'].str.lower())

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [122]:
print(df['Name'].str.upper())

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [123]:
print(df['Name'].str.capitalize())

0                                Braund, mr. owen harris
1      Cumings, mrs. john bradley (florence briggs th...
2                                 Heikkinen, miss. laina
3           Futrelle, mrs. jacques heath (lily may peel)
4                               Allen, mr. william henry
                             ...
886                                Montvila, rev. juozas
887                         Graham, miss. margaret edith
888             Johnston, miss. catherine helen "carrie"
889                                Behr, mr. karl howell
890                                  Dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [124]:
print(df['Name'].str.len())

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [125]:
df['Name'].str.replace("Mr.","Sir",regex=False).head()

0                              Braund, Sir Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Sir William Henry
Name: Name, dtype: object

In [127]:
df['Name'].str.replace(r"\(.*\)","",regex=True).head()

0          Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley
2           Heikkinen, Miss. Laina
3    Futrelle, Mrs. Jacques Heath
4         Allen, Mr. William Henry
Name: Name, dtype: object

In [128]:
#Extract with regex
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [129]:
df['Title'] = df['Name'].str.extract(r'(\(.*\))',expand=False)

In [130]:
df['Title']

0                           NaN
1      (Florence Briggs Thayer)
2                           NaN
3               (Lily May Peel)
4                           NaN
                 ...
886                         NaN
887                         NaN
888                         NaN
889                         NaN
890                         NaN
Name: Title, Length: 891, dtype: object

In [131]:
type(df['Name'].str.extract(r'(\(.*\))',expand=True))

pandas.core.frame.DataFrame

In [132]:
type(df['Name'].str.extract(r'(\(.*\))',expand=False))

pandas.core.series.Series

In [133]:
#split and access elements
df['Name'][0]

'Braund, Mr. Owen Harris'

In [134]:
df['Name'].str.split(",", expand=False)[0]

['Braund', ' Mr. Owen Harris']

In [135]:
df['Name'].str.split(",",expand=True)[0]

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: 0, Length: 891, dtype: object

In [137]:
df['Name'].str.split(" ",expand=True)[0]

0         Braund,
1        Cumings,
2      Heikkinen,
3       Futrelle,
4          Allen,
          ...
886     Montvila,
887       Graham,
888     Johnston,
889         Behr,
890       Dooley,
Name: 0, Length: 891, dtype: object

In [138]:
df['Name'].str.split(expand=True)[0]

0         Braund,
1        Cumings,
2      Heikkinen,
3       Futrelle,
4          Allen,
          ...
886     Montvila,
887       Graham,
888     Johnston,
889         Behr,
890       Dooley,
Name: 0, Length: 891, dtype: object

In [139]:
df['Name'].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [140]:
df['Name'].str.lstrip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [142]:
df['Name'].str.rstrip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [143]:
#Find position of substring
df['Name'].str.find("Mr.")

0      8
1     -1
2     -1
3     -1
4      7
      ..
886   -1
887   -1
888   -1
889    6
890    8
Name: Name, Length: 891, dtype: int64

In [144]:
#count number of passengers with "Miss" in name
count = df['Name'].str.contains("Miss").sum()
print("Number of 'Miss': ", count)

Number of 'Miss':  182

In [145]:
data = {
    'Name':['Sandeep','Sudeep','Riya','Madhuri'],
    'Email': ['sk@gmail.com','s@gamil.com', 'r@gmail.com','m@gmail.com']
}

In [146]:
df = pd.DataFrame(data)

In [147]:
df.head()

      Name         Email
0  Sandeep  sk@gmail.com
1   Sudeep   s@gamil.com
2     Riya   r@gmail.com
3  Madhuri   m@gmail.com

In [148]:
df['Name'].str.replace("Sandeep","Sumit",regex=False)

0      Sumit
1     Sudeep
2       Riya
3    Madhuri
Name: Name, dtype: object

In [149]:
df

      Name         Email
0  Sandeep  sk@gmail.com
1   Sudeep   s@gamil.com
2     Riya   r@gmail.com
3  Madhuri   m@gmail.com

In [150]:
df['Name'].str.replace("sandeep","Rohit",regex=False)

0    Sandeep
1     Sudeep
2       Riya
3    Madhuri
Name: Name, dtype: object

In [151]:
df['Name'].str.pad(width=20,side='left',fillchar='-')

0    -------------Sandeep
1    --------------Sudeep
2    ----------------Riya
3    -------------Madhuri
Name: Name, dtype: object

In [152]:
df['Name'].str.pad(width=20, side='right',fillchar='-')

0    Sandeep-------------
1    Sudeep--------------
2    Riya----------------
3    Madhuri-------------
Name: Name, dtype: object

In [153]:
#Options and customizations
df = pd.read_csv("titanic.csv")

In [154]:
pd.set_option('display.max_rows',5)

In [155]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
...,...,...,...,...,...,...,...,...,...,...,...,...
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [160]:
#show all columns
pd.set_option('display.max_columns',None)

In [157]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
...,...,...,...,...,...,...,...,...,...,...,...,...
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [158]:
pd.set_option('display.max_columns',3)

In [159]:
df

     PassengerId  ...  Embarked
0              1  ...         S
1              2  ...         C
..           ...  ...       ...
889          890  ...         C
890          891  ...         Q

[891 rows x 12 columns]

In [161]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [162]:
df[['Fare','Age']].head()

      Fare   Age
0   7.2500  22.0
1  71.2833  38.0
2   7.9250  26.0
3  53.1000  35.0
4   8.0500  35.0

In [164]:
pd.set_option('display.float_format','{:.2f}'.format)

In [165]:
df[['Fare','Age']].head()

   Fare   Age
0  7.25 22.00
1 71.28 38.00
2  7.92 26.00
3 53.10 35.00
4  8.05 35.00

In [166]:
pd.get_option('display.max_rows')

5

In [169]:
with pd.option_context('display.max_rows',3):#to work with sessions
    print(df)

     PassengerId  Survived  Pclass                     Name   Sex   Age  \
0              1         0       3  Braund, Mr. Owen Harris  male 22.00
..           ...       ...     ...                      ...   ...   ...
890          891         0       3      Dooley, Mr. Patrick  male 32.00

     SibSp  Parch     Ticket  Fare Cabin Embarked
0        1      0  A/5 21171  7.25   NaN        S
..     ...    ...        ...   ...   ...      ...
890      0      0     370376  7.75   NaN        Q

[891 rows x 12 columns]

In [168]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C
...,...,...,...,...,...,...,...,...,...,...,...,...
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.75,NaN,Q

In [170]:
pd.reset_option('display.max_rows')

In [171]:
pd.get_option('display.max_rows')

60

In [172]:
pd.reset_option('all')

C:\Users\aukar\AppData\Local\Temp\ipykernel_39768\2786130087.py:1: FutureWarning: data_manager option is deprecated and will be removed in a future version. Only the BlockManager will be available.
  pd.reset_option('all')
C:\Users\aukar\AppData\Local\Temp\ipykernel_39768\2786130087.py:1: FutureWarning: use_inf_as_na option is deprecated and will be removed in a future version. Convert inf values to NaN before operating instead.
  pd.reset_option('all')

In [174]:
import warnings

with warnings.catch_warnings():
    warnings.simplefilter('ignore',FutureWarning)
    pd.reset_option('all')

In [175]:
#categorical data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [176]:
print(df['Sex'].dtype)

object

In [178]:
#convert a column to categorical
df['Sex_C'] = df['Sex'].astype('category')

In [179]:
df[['Sex','Sex_C']].head()

      Sex   Sex_C
0    male    male
1  female  female
2  female  female
3  female  female
4    male    male

In [180]:
print(df['Sex'].dtype)
print(df['Sex_C'].dtype)

object
category

In [181]:
print(df['Sex_C'].cat.codes.head())

0    1
1    0
2    0
3    0
4    1
dtype: int8

In [182]:
df['Sex_C_Categorical_Codes'] = df['Sex_C'].cat.codes

In [183]:
df[['Sex','Sex_C','Sex_C_Categorical_Codes']].head()

      Sex   Sex_C  Sex_C_Categorical_Codes
0    male    male                        1
1  female  female                        0
2  female  female                        0
3  female  female                        0
4    male    male                        1

In [187]:
df['Sex_apply_category']= df['Sex'].apply(lambda x:0 if x == 'male' else 1)

In [188]:
df[['Sex','Sex_C','Sex_C_Categorical_Codes','Sex_apply_category']].head()

      Sex   Sex_C  Sex_C_Categorical_Codes  Sex_apply_category
0    male    male                        1                   0
1  female  female                        0                   1
2  female  female                        0                   1
3  female  female                        0                   1
4    male    male                        1                   0

In [189]:
df['Pclass'].unique()

array([3, 1, 2])

In [191]:
#Date Functionality in Pandas
df = pd.DataFrame({
    'Event': ['Concert','Conference','Wedding'],
    'Date' : ['2025-01-01','2025-03-15','2025-07-20']
})

In [192]:
df

        Event        Date
0     Concert  2025-01-01
1  Conference  2025-03-15
2     Wedding  2025-07-20

In [193]:
df['date_pandas'] = pd.to_datetime(df['Date'])

In [194]:
df.head()

        Event        Date date_pandas
0     Concert  2025-01-01  2025-01-01
1  Conference  2025-03-15  2025-03-15
2     Wedding  2025-07-20  2025-07-20

In [197]:
print(df.dtypes[['Event','Date','date_pandas']])

Event                  object
Date                   object
date_pandas    datetime64[ns]
dtype: object

In [198]:
df['date_pandas'].dt.year

0    2025
1    2025
2    2025
Name: date_pandas, dtype: int32

In [199]:
df['date_pandas'].dt.month

0    1
1    3
2    7
Name: date_pandas, dtype: int32

In [200]:
df['date_pandas'].dt.day

0     1
1    15
2    20
Name: date_pandas, dtype: int32

In [201]:
df['date_pandas'].dt.weekday

0    2
1    5
2    6
Name: date_pandas, dtype: int32

In [202]:
df['date_pandas'].dt.day_name()

0    Wednesday
1     Saturday
2       Sunday
Name: date_pandas, dtype: object

In [203]:
df['date_pandas'].dt.is_month_end

0    False
1    False
2    False
Name: date_pandas, dtype: bool

In [204]:
df[df['date_pandas'] > '2025-04-01']

     Event        Date date_pandas
2  Wedding  2025-07-20  2025-07-20

In [205]:
df[df['date_pandas'].between('2025-01-01','2025-06-01')]

        Event        Date date_pandas
0     Concert  2025-01-01  2025-01-01
1  Conference  2025-03-15  2025-03-15

In [206]:
#date range
pd.date_range(start='2024-01-01',end='2024-01-10',freq='D')

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [207]:
pd.date_range(start='2025-01-01', end='2025-04-30', freq='ME')

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30'], dtype='datetime64[ns]', freq='ME')

In [208]:
pd.date_range(start='2025-01-01', end='2025-04-30', freq='MS')

DatetimeIndex(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01'], dtype='datetime64[ns]', freq='MS')

In [209]:
#Date Arithmetic
df['next_week'] = df['date_pandas'] + pd.Timedelta(days=7)

In [210]:
df

        Event        Date date_pandas  next_week
0     Concert  2025-01-01  2025-01-01 2025-01-08
1  Conference  2025-03-15  2025-03-15 2025-03-22
2     Wedding  2025-07-20  2025-07-20 2025-07-27

In [211]:
df['days_to_event'] = df['date_pandas'] - pd.Timestamp.today()

In [212]:
df

        Event        Date date_pandas  next_week              days_to_event
0     Concert  2025-01-01  2025-01-01 2025-01-08 -193 days +15:53:26.265274
1  Conference  2025-03-15  2025-03-15 2025-03-22 -120 days +15:53:26.265274
2     Wedding  2025-07-20  2025-07-20 2025-07-27     7 days 15:53:26.265274